Revit 2027 API
Rebar.GetFreeFormAccessor Method
 Returns an interface providing access to free-form properties and methods for this Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarFreeFormAccessor GetFreeFormAccessor()
Public Function GetFreeFormAccessor As RebarFreeFormAccessor
public:
RebarFreeFormAccessor^ GetFreeFormAccessor()
member GetFreeFormAccessor : unit -> RebarFreeFormAccessor
Return Value
RebarFreeFormAccessor
 The interface providing access to free-form properties and methods for this Rebar element.
Exceptions
Exception | Condition
InvalidOperationException |  This method applies only to free form rebar.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace